
# -*- coding: utf-8 -*-
import streamlit as st
import pandas as pd

def show():
    st.title("مرحباً بك 👋")
    st.markdown("""

    هنا صفحة التنبؤ لنموذج الفقر متعدد الابعاد الخاص بالأسر اليمنية تتوفر خدمتنا عبر طريقتين هما:
    1. **إدخال بيانات أسرة واحدة* للحصول على نتيجة فورية.
    2. **تنبؤ لأسر متعددة** عبر رفع ملف Excel/CSV، وسيتم إضافة عمود بالتنبؤات لتنزيله.

    > تلميحات سريعة:
    > - في كل صفحة يمكنك رفع ملف النموذج المدرب ان كان لديك  نموذج مدرب (`.pkl` أو `.joblib`).
    > - يوجد في الاسفل تعريفات عن المتغيرات و القيم المدخلة.

    """)

    instructions = pd.DataFrame({
        "المتغير": ["HH48A_HC3", "FC6A", "HC7A", "HC7B", "HC8", "HC9A", 
                    "HC9B", "HC9C", "HC10B", "HC10C", "HC10E", "HC11", "HC12", "HC13", "HC14", "HC15", "HC17",
                    "EU4", "WS1", "WS4", "WS7", "WS11", "WS15", "NU_malnutrition_hh", "HE_earlychild_hh", "HE_immune_hh", "HE_antecare_hh", "HE_birthassist_hh",
                        "ED_attendance_hh", "ED_completion_hh:", "ED_gradeforage_hh", "ED_adult_hh"],
        "الوصف": [
            "ناتج قسمة عدد الافراد على عدد الغرف",
            "هل حدث هذا خلال الأسبوعين الماضيين (30 يومًا)؟",
            "هل لدى الأسرة خط هاتف أرضي؟",
            "هل لدى الأسرة جهاز راديو؟",
            "هل متوفر لدى الأسرة إمداد كهربائي؟",
            "هل لدى الأسرة جهاز تلفزيون؟",
            "هل لدى الأسرة ثلاجة؟",
            "هل لدى الأسرة غسالة ملابس؟",
            "هل يملك أحد أفراد الأسرة دراجة هوائية؟",
            "هل يملك أحد أفراد الأسرة دراجة نارية أو دراجة بخارية؟",
            "هل يملك أحد أفراد الأسرة سيارة أو شاحنة أو باص صغير؟",
            " هل يملك أحد أفراد الأسرة جهاز كمبيوتر؟",
            "هل يملك أحد أفراد الأسرة هاتفًا محمولًا؟",
            "هل يتوفر لدى الأسرة خدمة إنترنت في المنزل؟",
            "هل تمتلك الأسرة المنزل الذي تسكن فيه؟",
            "هل يملك أحد أفراد الأسرة أرضًا زراعية؟",
            "هل تمتلك الأسرة أي حيوانات؟",
            "نوع مصدر الطاقة المستخدم في الموقد",
            "المصدر الرئيسي لمياه الشرب",
            "الوقت اللازم (بالدقائق) للحصول على المياه والعودة",
            "هل حدث نقص في إمدادات المياه خلال الشهر الماضي؟",
            " نوع المرافق الصحية",
            "هل المرافق الصحية مشتركة؟",
            "هل هناك اطفال يتراوح اعمارهم بين 0 و 59 شهراً يعاني من قصور في النمو او يعاني من نقص في الوزن ",
            " هل هناك إمرأة في الاسرة انجبت طفلاً حياً خلال العامين السابقين عندما كانت دون سن 18 عاماً",
            "هل هناك اطفال يتراوح اعمارهم بين 12 و35 شهراً ولم يتلقوا جرعات لقاح DPT1 و DPT2 و DPT3 ",
            "هل تلقت الأم الرعاية الصحية  اللازمة خلال فترة الحمل (زيارة الطيبيب على الاقل 4 مرات )",
            "هل هناك امرأة في اسرتك لم تلد تحت إراف كوادر صحية مؤهلة",
            "هل هناك طفل يتراوح عمره بين 6 و 12 عاماً لا يذهب الى المدرسة",
            " هل هناك طفل يتراوح عمره بين 14 و 17 عاماً لم يكمل السنوات الست الأولى من التعليم",
            "هل هناك طفل يقل مستواه الدراسي عن المستوى المناسب لعمره بأكثر من عامين",
            "هل هناك احد من افراد الاسرة على الأقل تتجاوز اعمارهم 17 عاماً لم يكملوا السنوات الست الأولى من التعليم "
        ]
    })

    st.subheader("ℹ️ تعريفات المتغيرات")
    st.table(instructions)

    # 🔹 جدول التعليمات في الأعلى
    instructions = pd.DataFrame({
        "المتغير": ["HH48A_HC3", "FC6A", "HC7A", "HC7B", "HC8", "HC9A", 
                    "HC9B", "HC9C", "HC10B", "HC10C", "HC10E", "HC11", "HC12", "HC13", "HC14", "HC15", "HC17",
                    "EU4", "WS1", "WS7", "WS11", "WS15", "NU_malnutrition_hh", "HE_immune_hh", "HE_antecare_hh", "HE_birthassist_hh",
                        "ED_attendance_hh", "ED_completion_hh:", "ED_gradeforage_hh", "ED_adult_hh"],
        "الوصف": [
            "يحسب الطفل الذي يتراوح عمره بين 0 و 4 اعوام نصف فرد وما دون ذلك يعتبر فرد",
            "  لا → 0  نعم → 1",
            " لا → 0  نعم → 1",
            " لا → 0  نعم → 1",
            "نعم، شبكة خاصة → 3  نعم، خارج الشبكة (مولد/نظام معزول) → 2  نعم، شبكة مترابطة → 1  لا كهرباء → 0 نعم، طاقة شمسية → 4",
            " لا → 0  نعم → 1",
            " لا → 0  نعم → 1",
            " لا → 0  نعم → 1",
            " لا → 0  نعم → 1",
            " لا → 0  نعم → 1",
            " لا → 0  نعم → 1",
            " لا → 0  نعم → 1",
            " لا → 0  نعم → 1",
            " لا → 0  نعم → 1",
            " لا → 0  نعم → 1",
            " لا → 0  نعم → 1",
            " لا → 0  نعم → 1",
            " لا يستخدم وقود صلب → 0  ,يستخدم وقود صلب → 1",
            " مياه بالأنابيب: مياه موصولة إلى المسكن → 5  مياه معبأة في أكياس→ 4 مياه معبأة: مياه معبأة → 3  بئر محفور: بئر غير محمي→ 2  بئر محفور: بئر محمي→ 1  عربة بخزان صغير→ 0   بئر أنبوبي / بئر حفر → 14  شاحنة صهريج → 13  مياه سطحية (نهر، سد، بحيرة، بركة، مجرى مائي، قناة، قناة ري)→ 12  نبع غير محمي → 11  نبع محمي → 10  مياه الأمطار →9   مياه بالأنابيب: صنبور عام/أنبوب عمودي  → 8  مياه بالأنابيب: مياه إلى الفناء/قطعة الأرض → 7  مياه بالأنابيب: مياه إلى الجار → 6",
            " لا، دائمًا كافٍ → 0  نعم، مرة واحدة على الأقل→ 1",
            " مرحاض الحفرة: مرحاض الحفرة المُحسّن المُهوى → 8 مرحاض الحفرة: مرحاض الحفرة بدون بلاطة / حفرة مفتوحة → 7  مرحاض الحفرة: مرحاض الحفرة مع بلاطة → 6  لا يوجد مرفق / شجيرة / حقل→ 5  شطف/صب: شطف إلى مرحاض الحفرة → 4  شطف/صب: شطف إلى نظام الصرف الصحي → 3  شطف/صب: شطف إلى مصرف مفتوح → 2  شطف/صب: شطف إلى حيث لا اعرف → 1  دلو → 0",
            " لا → 0  نعم → 1",
            " لا → 0  نعم → 1",
            " لا → 0  نعم → 1",
            " لا → 0  نعم → 1",
            " لا → 0  نعم → 1",
            " لا → 0  نعم → 1",
            " لا → 0  نعم → 1",
            " لا → 0  نعم → 1",
            " لا → 0  نعم → 1"
        ]
    })

    st.subheader("ℹ️ تعليمات الإدخال")
    st.table(instructions)

    st.info("من الشريط الجانبي لِكل صفحة: ارفع النموذج وعينة للبيانات إن رغبت. ثم اتبع الخطوات الظاهرة.")
    st.markdown("---")
    st.markdown("ابدأ من تبويب الصفحات في الشريط الجانبي 👈")



